app/Models/ModelJenispemeriksaan.php

    public function AllData()
    {
        return $this->db->table('tbl_jenis_pemeriksaan')
            ->get()
            ->getResultArray();
---
SELECT *
FROM `tbl_jenis_pemeriksaan`

    public function InsertData($data)
    {
        $this->db->table('tbl_jenis_pemeriksaan')->insert($data);
---
INSERT INTO `tbl_jenis_pemeriksaan` (`nama_pemeriksaan`) VALUES ('Penimbangan')