app/Models/ModelAnak.php

SELECT *
FROM `tbl_anak`
JOIN `tbl_ibu` ON `tbl_ibu`.`id_ibu`=`tbl_anak`.`id_ibu`
---
    public function AllData()
    {
        return $this->db->table('tbl_anak')
            ->join('tbl_ibu', 'tbl_ibu.id_ibu=tbl_anak.id_ibu')
            ->get()
            ->getResultArray();