app/Models/ModelJadwal.php

    public function AllData()
    {
        return $this->db->table('tbl_jadwal')
            ->join('tbl_kategori', 'tbl_kategori.id_kategori=tbl_jadwal.id_kategori')
            ->get()
            ->getResultArray();
---
SELECT *
FROM `tbl_jadwal`
JOIN `tbl_kategori` ON `tbl_kategori`.`id_kategori`=`tbl_jadwal`.`id_kategori`

    public function InsertData($data)
    {
        $this->db->table('tbl_jadwal')->insert($data);
---
INSERT INTO `tbl_jadwal` (`tanggal`, `lokasi`, `id_kategori`) VALUES ('2025-05-15', 'Jalan Raya Papua Barat Manokwari', '1')

    public function UpdateData($data)
    {
        $this->db->table('tbl_jadwal')
            ->where('id_jadwal', $data['id_jadwal'])
            ->update($data);
---
UPDATE `tbl_jadwal` SET `id_jadwal` = '2', `tanggal` = '2025-05-16', `lokasi` = 'Jalan Raya Papua Barat Manokwari', `id_kategori` = '1'
WHERE `id_jadwal` = '2'