app/Models/ModelPemeriksaan.php

    public function AllData()
    {
        return $this->db->table('tbl_pemeriksaan')
            ->join('tbl_anak', 'tbl_anak.id_anak=tbl_pemeriksaan.id_anak')
            ->join('tbl_jadwal', 'tbl_jadwal.id_jadwal=tbl_pemeriksaan.id_jadwal')
            ->join('tbl_user', 'tbl_user.id_user=tbl_pemeriksaan.id_user')
            ->get()
            ->getResultArray();
---
SELECT *
FROM `tbl_pemeriksaan`
JOIN `tbl_anak` ON `tbl_anak`.`id_anak`=`tbl_pemeriksaan`.`id_anak`
JOIN `tbl_jadwal` ON `tbl_jadwal`.`id_jadwal`=`tbl_pemeriksaan`.`id_jadwal`
JOIN `tbl_user` ON `tbl_user`.`id_user`=`tbl_pemeriksaan`.`id_user`