app/Models/ModelIbu.php

SELECT *
FROM `tbl_ibu`
---
    public function AllData()
    {
        return $this->db->table('tbl_ibu')
            ->get()
            ->getResultArray();