app/Models/ModelAdmin.php

    public function JumlahAnak()
    {
        return $this->db->table('tbl_anak')->countAll();
---
SELECT COUNT(*) AS `numrows` FROM `tbl_anak`

    public function JumlahIbu()
    {
        return $this->db->table('tbl_ibu')->countAll();
---
SELECT COUNT(*) AS `numrows` FROM `tbl_ibu`

    public function JumlahPemeriksaan()
    {
        return $this->db->table('tbl_detail_pemeriksaan')->countAll();
---
SELECT COUNT(*) AS `numrows` FROM `tbl_detail_pemeriksaan`

    public function JumlahUser()
    {
        return $this->db->table('tbl_user')->countAll();
---
SELECT COUNT(*) AS `numrows` FROM `tbl_user`