app/Models/ModelUser.php

    public function getPetugas()
    {
        return $this->db->table('tbl_user')
            ->where('level', 2)
            ->get()
            ->getResultArray();
---
SELECT *
FROM `tbl_user`
WHERE `level` = 2

    public function DeleteData($data)
    {
        $this->db->table('tbl_user')
            ->where('id_user', $data['id_user'])
            ->delete($data);
---
DELETE FROM `tbl_user`
WHERE `id_user` = '5'
AND `id_user` = '5'