app/Models/ModelDetailpemeriksaan.php

SELECT *
FROM `tbl_detail_pemeriksaan`
JOIN `tbl_pemeriksaan` ON `tbl_pemeriksaan`.`id_pemeriksaan`=`tbl_detail_pemeriksaan`.`id_pemeriksaan`
JOIN `tbl_jenis_pemeriksaan` ON `tbl_jenis_pemeriksaan`.`id_jenis_pemeriksaan`=`tbl_detail_pemeriksaan`.`id_jenis_pemeriksaan`
JOIN `tbl_anak` ON `tbl_anak`.`id_anak` = `tbl_pemeriksaan`.`id_anak`
---
    public function AllData()
    {
        return $this->db->table('tbl_detail_pemeriksaan')
            ->join('tbl_pemeriksaan', 'tbl_pemeriksaan.id_pemeriksaan=tbl_detail_pemeriksaan.id_pemeriksaan')
            ->join('tbl_jenis_pemeriksaan', 'tbl_jenis_pemeriksaan.id_jenis_pemeriksaan=tbl_detail_pemeriksaan.id_jenis_pemeriksaan')
            ->join('tbl_anak', 'tbl_anak.id_anak = tbl_pemeriksaan.id_anak')
            ->get()
            ->getResultArray();